{"﻿Professor Scott Singeisen\nNorth Carolina Central University\nAssociate Professor of Architecture\nDepartment of Art & Design\nssingeis@nccu.edu\n\n\nACADEMIC POSITIONS:\t\nAdministrative:\t\n2007-2012\tDepartment Chair, Department of Architecture, Savannah College of Art and Design, Savannah, GA. Administrative and academic leader of a top twenty-five nationally recognized NAAB accredited professional M.Arch degree program, pre-professional Bachelor of Fine Arts degree program, Master of Urban Design program, and two post-professional MFA programs enrolling 450 +/- undergraduates and 100 +/- graduate students.\n2016 - 2023\tGraduate Coordinator, Department of Architecture, M.Arch, Savannah College of Art and Design, Savannah, GA. (September 2016 - May 2023).\nFaculty:\t\n2023-present\tAssociate Professor of Architecture, Department of Art & Design, North Carolina Central University, Durham, NC. As the inaugural professor of architecture at NCCU, (the first pre-architecture program at an HBCU in NC), Prof. Singeisen focuses his attention on both teaching and building a strong curriculum, recruiting, and retaining students and promoting the advantages of the program to practitioners, potential students, and the public.\n2004-2023\tProfessor of Architecture & Urban Design, Department of Architecture, Savannah College of Art and Design, Savannah, GA. Teaching experience across all studio levels of the curriculum, with focused teaching in undergraduate and graduate architecture studios, architectural representation, graphics for the building arts, and beginning design student courses.\n2007\tVisiting Professor of Architecture, Fellowship Teaching Appointment, School of Architecture, University of Hawaii at Manoa, Honolulu, HI.\n1997-1998\tAdjunct Professor, College of Design, Southern College, Orlando, FL.\nPRACTICE POSITIONS:\n2021-2023\tThe Parallax View, radio host, on WRUU 107.5FM/wruu.org. The Parallax View is a weekly radio program that engages the listeners and uses the city's built forms and public spaces as the subject. Weekly conversations disentangle and make more intelligible topics on the design and urbanism that shape our lives.\n2011-2021\tJasper Design Services, LLC was a boutique design practice providing critical solutions and strategies for diverse regional and international clients.\n2015-2016\tFix It & Finish It, co-host and lead designer of episodes filmed in Savannah, GA of the nationally syndicated television program\nFix It And Finish It 1114 - Fish Tank Office https://vimeo.com/126700532\nFix It And Finish It 1115 - Miracle Modernized Kitchen https://vimeo.com/126700694\nFix It And Finish It 1116 - Garage Boutique https://vimeo.com/126701492\n1998-2003\tBurke, Hogue & Mills Associates, Inc., Lake Mary, FL. Associate and Project Manager/Designer.\n1997-1998\tNudell Architects, Farmington Hills, MI/ Mount Dora, FL. Project Manager/Designer.\n1996-1997\tFORUM Architecture & Interior Design, Inc., Altamonte Springs, FL. Job Captain.\n1995-1996\tThe Tignor Group, P.A., Sarasota, FL. Intern Architect.\n1994-1995\tStevenson Architects, Inc., Bradenton, FL. Intern Architect.\nEDUCATION:\t\n\tB.F.A., Architecture, Savannah College of Art and Design, Savannah, GA\nM.Arch, Architecture, Savannah College of Art and Design, Savannah, GA\n\nLICENSURES and CERTIFICATIONS:\nNCARB Record Number: 74335\nPROFESSIONAL MEMBERSHIPS:\n2024\tNational Organization of Minority Architects. (2024 - Present).\nAWARDS AND HONORS:\nProfessional\n2024\tOutstanding Achievement in Research, NCCU, College of Arts, Social Sciences, and Humanities, Department of Art & Design. (April 10, 2024).\n2024 \tInvited CriticalMass Guest Critic, UNCC School of Architecture. (April 5, 2024).\n2015\tDean’s Award for Cross-disciplinary Collaboration, for ‘Dakota Jackson Retrospective of the Future’, exhibition design for the Savannah College of Art and Design Museum of Art, lead faculty member.\n2015\tFaculty Recognition Award, Savannah College of Art and Design, American Institute of Architecture Students, Savannah, GA.\n2006\tFlorida Trust Historic Preservation Award: Tarragona Arch, Florida Trust for Historic Preservation for outstanding achievement in the Field of Restoration and Rehabilitation, Daytona Beach, FL.\n2004\tFlorida Trust Historic Preservation Award: Daytona Beach Bandshell, Florida Trust for Historic Preservation for outstanding achievement in the Field of Restoration and Rehabilitation, Daytona Beach, FL.\n2004\tABC Excellence in Construction Eagle Award: Lakeview Middle School Historic Restoration $1 to $5 Million Category, Winter Garden, FL.\n1998\tAdjunct Professor of the Year, College of Design, Southern College, Orlando, FL.\nRecognition of Student’s Work (Selected)\n2019\tThesis Project selected for award: Leung, Stanley “Above the Clouds. Colonization in a Post-Nuclear War Scenario.” American Institute of Architects Georgia. Atlanta, GA: 2019 AIA Georgia Design and Honor Awards (2019) Committee Chair\n2019\tThesis Project selected for award: Manzo, Ana “Somatic Action: Play. Influence of Architecture in Sex Differences.” American Institute of Architects Georgia. Atlanta, GA: 2019 AIA Georgia Design and Honor Awards (2019) Committee Chair\n2018\tAIA Savannah Chapter Award for Graduate Thesis in Architecture. Vik Gurav. 2018. Committee Chair\n2017\tThesis Project selected for publication: Imran, Natalie “Illusions of the Eternal: The Palimpsest of Boundary.” Contract. New York, NY: 38th Annual Interiors Awards Student Award (2017): 130-133. Committee Chair\n2017\tThesis Project selected for award: Imran, Natalie “Illusions of the Eternal: The Palimpsest of Boundary.” American Institute of Architects Georgia. Atlanta, GA: 2017 AIA Georgia Design and Honor Awards (2017) Committee Chair\n2017\tThesis Project selected for publication: Imran, Natalie “Illusions of the Eternal: The Palimpsest of Boundary.” American Society of Architectural Illustrators. New York, NY: 32nd Annual Architecture in Perspective Student Award of Distinction (2017) Committee Chair\n2017\tThesis Project selected for award: Urizar, Alazne “Differential Obsolescence: Activating the Shells of the Past.” International Design Awards. New York, NY: GOLD in Architecture/ Renovation (2017) Committee Chair\n2016\tAIA Savannah Chapter Award for Graduate Thesis in Architecture. Natalie Imran. 2016. Committee Chair\n2013\tUSGBC Savannah Chapter Thesis Award. Desiree Johnson. 2013. Committee Chair\n2010\tUSGBC Savannah Chapter Thesis Award. Taylor Sill. 2010. Committee member\nMEDIA APPEARANCES AND INTERVIEWS:\n2019\t\"Field trip enlightens architecture students.,\" SCAD.edu. (January 2019).\n2014\t\"More Details Emerge for Broughton Street Proposal.,\" All Things Considered: Georgia Public Broadcasting, Savannah, GA. (February 11, 2014).\n2013\t\"SCAD students tackle Savannah's linear park and streetcar projects.,\" Savannah Morning News (Georgia). (December 19, 2013).\n2012\t\"People Instead of Cars Occupy Metered Parking Spaces.,\" The News at 6: WSAV TV, Savannah, GA. (September 23, 2012).\n2012\t\"SCAD Students Participate in PARK(ing) Day.,\" Savannah Morning News. (September 23, 2012).\n2012\t\"What will you do with your public space today?\", The South. (September 21, 2012).\n2008\t\"Design for London,\" Global Atlanta. (November 2008).\n2008\t\"Habitat for Humanity home blends into a historic district in Savannah.,\" USA TODAY. (March 7, 2008).\n2008\t\"Notes from the teach-in.,\" sustainablesavannah.com. (February 2008).\n2007\t\"Schools introduce natural light and individual spaces.,\" International Herald Tribune. (October 13, 2007).\n2006\t\"Architecture students help rebuild Pass Christian, Miss.,\" The Chronicle. (February 24, 2006).\n2005\t\"Students garner real-world experience in the classroom.,\" The Chronicle. (January 14, 2005).\nPUBLICATIONS:\nBooks\n2006 \tSingeisen, S., & Brooks, D. (2006, June). Building Patterns - Affordable Housing Pattern Book for the Southeast. Savannah, GA: Coastal Empire Habitat for Humanity.\nConference Proceedings\n2024\tSingeisen, S. (2024, July). Fluid Pedagogy: The Queer Art of Failure in Architectural Studio Teaching. In: Gregory Hurcomb, et.al. (eds.), AMPS Proceedings Series 36.2. Teaching Beyond the Curriculum – A Focus on Pedagogy. Glasgow School of Art, Louisiana State University, Wenzhou-Kean University. 15 – 17 November (2023). pp. 336-343 https://amps-research.com/proceedings/\n2021\tSingeisen, S. (2019, September). Disorienting Dilemma. In 2019 ACSA/EAAE Teachers Conference. The Practice of Teaching | Teaching of Practice. University of Antwerp, Antwerp, Belgium.\n2019\tSingeisen, S. (2019, March). Five Analogous Elements: A Contextual Pedagogical Approach. In National Conference on the Beginning Design Student (Vol. 35, No. 1).  Constructing Context. University of Colorado Denver, College of Architecture and Planning.\n2018\tSingeisen, S. (2018). Polysemic and Monosemic – Image as Agent in the Design Process. In Virtual + Actual: Process and Product of Design (pp. 116–124). Cornell University, Ithaca, NY: DCA.\n2018\tSingeisen, S. (2018, September). The _torium. In National Conference on the Beginning Design Student (Vol. 34, No. 1). University of Cincinnati, College of Design, Architecture Art and Planning, Cincinnati, OH: University of Cincinnati Press.\n2014\tSingeisen, S. (2014, April). The Role of Analytique/Hybrid Drawing in Beginning Design. In Materiality: Essence + Substance (p. 560). Illinois Institute of Technology, College of Architecture. Chicago, IL.\n2009 \tDirlam, David, & Singeisen, Scott. (2009, March). Collaboratively Crafting a Unique Architecture Education Through MODEL Assessment. In Crisman, Phoebe & Gillem, Mark L (Eds.), The value of design: Design is at the core of what we teach and practice (pp. 445–455). Portland, Oregon: ACSA Press": null, " Distributed by Assoc. of Collegiate Schools of Architecture.\n2007 \tSingeisen, S. (2007, October). Designing Stewards: A collaboration-based outreach course offering. In Assuming Responsibility: The Architecture of Stewardship (pp. 176–181). The Catholic University of America School of Architecture, Washington, D.C.: School of Architecture and Planning, The Catholic University of America.\n2007\tSingeisen, S. (2007, October). Designing Cities: Designing Students. In R. Haldenby & J. Lederer (Eds.), City/ Campus (pp. 730–739). University of Waterloo School of Architecture, Waterloo, ON: Riverside Architectural Press, University of Waterloo.\nNon-peer reviewed articles\n2015\tSingeisen, S. (2015, September). This is Architecture – Not Tinder. Retrieved November 7, 2016, from https://blog.scad.edu/scadarch/2015/09/17/this-is-architecture-not-tinder\n2005 \tSingeisen, S. (2005, April). Savannah Preservation Efforts Embrace Modernism. DOCOMOMO Georgia Chapter Publication.\nPRESENTATIONS:\nConferences\n2024 \tSingeisen, S., CAA 113TH Annual Conference, \"The Influence of Fine Art Printmaking on Architectural Image Production and Reception,\" College Art Association, New York, NY, United States. (accepted to present February 12–15, 2025).\n2024\tSingeisen, S., SESAH 2024 Annual Meeting and Conference, \"The Influence of Lithography Printmaking on Architectural Image Production and Reception,\" Southeast Society of Architectural Historians, Department of Architecture, College of Architecture and Construction Management at Kennesaw State University, Marietta Campus, Marietta, GA, United States. (October 4, 2024).\n2024 \tSingeisen, S., NCCU CASH Friday Afternoon Scholars, \"Fluid Pedagogy: The Queer Art of Failure in Architectural Studio Teaching,\" College of Art, Social Sciences, and Humanities, On-line, Durham, NC, United States. (April 5, 2024).\n2024 \tSingeisen, S., Faculty Research Award Program, \"3 Minute Thesis FRAP Appreciation Dinner,\" NCCU Dept of Graduate Studies, University Towers, Durham, NC, United States. (April 3, 2024).\n2023\tSingeisen, S., “Fluid Pedagogy, Fluid Architecture”, AMPS Teaching Beyond the Curriculum, LSU, USA/ Glasgow, UK/ Wenzhou, China. (November 17, 2023).\n2019\tSingeisen, S., “Disorienting Dilemma”, ACSA/EAAE Teachers Conference, University of Antwerp, Antwerp, Belgium.\n2019\tSingeisen, S., “Five Analogous Elements: A Contextual Pedagogical Approach”, National Conference on the Beginning Design Student, University of Colorado Denver, College of Architecture and Planning, Denver, Colorado\n2018\tSingeisen, S., “Polysemic and Monosemic – Image as Agent in the Design Process”, Design Communication Association Bi-Annual Conference, Cornell University, Ithaca, New York.\n2018\tSingeisen, S., “The _torium”, National Conference on the Beginning Design Student, University of Cincinnati, College of Design, Architecture Art and Planning, Cincinnati, Ohio.\n2013\tSingeisen, S., “The Democracy of Public Space”, 16th Annual US/ICOMOS Scientific Symposium, The Historic Center and the Next City: Envisioning Urban Heritage Evolution, SCAD, Savannah, Georgia.\n2013\tSingeisen, S., and Gedalla, M., “Design and Drawing: Hand and Computer Drawing in the Beginning Courses”, National Conference on the Beginning Design Student, The Making of Place, Temple University, Tyler School of Art, Architecture Department, Philadelphia, Pennsylvania. \n2013\tSingeisen, S. and Carter, W., “Intuition”, National Conference on the Beginning Design Student, The Making of Place, Temple University, Tyler School of Art, Architecture Department, Philadelphia, Pennsylvania. \n2012 \tSingeisen, S., “The Public Space of the City”, Inhabiting the New/Inhabiting Again in Times of Crisis. Department of Urban Design and Planning, Federico II University of Naples, Italy.\n2009 \tDirlam, D. and Singeisen, S., “Collaboratively Crafting a Unique Architecture Education Through MODEL Assessment”, Association of Collegiate Schools of Architecture Annual Conference, University of Portland, Portland, Oregon.\n2009\tSingeisen, S., “Collaboratively Crafting a Unique Architecture Education through MODEL Assessment”, MUSE Conference: Measuring Unique Studies Effectively, SCAD, Savannah, Georgia.\n2008 \tSingeisen, S., “Collaboratively Crafting a Unique Architecture Education through MODEL Assessment”, sid 2008 7th International Workshop on Social Intelligence Design, Designing socially aware interactions, University of Puerto Rico, San Juan, Puerto Rico.\n2007 \tSingeisen, S., “Designing Stewards: A collaboration-based outreach course offering”, Association of Collegiate Schools of Architecture Regional Conference, Assuming Responsibility: The Architecture of Stewardship. The Catholic University of America School of Architecture, Washington, D.C.\n2007\tSingeisen, S., “Designing Cities: Designing Students”, Association of Collegiate Schools of Architecture Regional Conference, City/ Campus, University of Waterloo School of Architecture, Waterloo, Ontario.\nInvited Lectures\n2024 \tSingeisen, S., \"Disegno,\" UNCC School of Architecture, Storrs Hall, Charlotte, NC, United States. (April 1, 2024).\n2013\tSingeisen, S. (2013, August). The effects of sea level rise on the democracy of public space. Lecture presented at the Georgia Conservancy sponsored Georgia Technical University design studio, Pinpoint Heritage Museum, Pinpoint, GA.\n2012 \tSingeisen, S. (2012, February). OMS-Sanford: Energy Efficiency and Historic Buildings. Lecture presented at the APA Florida Chapter, Orlando Metro Section, Sanford, FL.\n2007\tSingeisen, S. (2007, February). Architecture. Lecture presented to high school students interested in pursuing architecture as an area of study at the college level, Starkville, MS.\n2006 \tSingeisen, S. (2006, April). Green? So that’s what the kids are calling it! The Environmental Responsiveness of Regional Modernism in the Sarasota School of Architecture. Lecture presented at the Project Green Annual Meeting, Savannah College of Art and Design, Savannah, GA.\n2003 \tSingeisen, S. (2003, May). Design Presentation Alternatives: MColor. Lecture presented at the Society of Design Administrators Meeting, Orlando, FL.\n2002\tSingeisen, S. (2002, June). Office Collaboration Model: Architecture & Interior Design. Lecture presented at the Society of Design Administrators Meeting, Orlando, FL.\n2000 \tSingeisen, S. (2000, May). The Legacy of Addison Mizner on Florida Architecture. Lecture presented at the Membership of the Country Club of Orlando, Orlando, FL.\nPanels and Colloquia\n2015\tSingeisen, S. (2015, April). The Text/Context of Architectural Drawing. Presenter and Collocutor presented at the 10th Symposium: Text & Context, Savannah, GA.\n2014\tSingeisen, S. (2014, May). Doppelganger. Presenter and Collocutor presented at the 9th Symposium: A Matter of Opinion - Criticism and Discourse in/of/and Art, Architecture, Design, and Media, Savannah, GA.\n2013\tSingeisen, S. (2013, March). The Mapping of Public Space. Presenter and Collocutor presented at the 8th Symposium: Mapping Techne, Savannah, GA. \n2013\tDefining Modernity. (2013, February). Session chair at the 8th Savannah Symposium: Modernities Across Time and Space, Savannah, GA.\n2013 \tHallowed Ground. (2011, February). Session chair at the 7th Savannah Symposium: The Spirituality of Place, Savannah, GA.\n2010 \tSingeisen, S. (2010, December). BIM for Renovation and Retrofit. Lecture presented at the Applied Software Symposium, Savannah, GA.\n2013 \tHeritage sites as loci of cultural expression and power. (2009, February). Session chair at the 6th Savannah Symposium: World Heritage and National Registers in Perspective, Savannah, GA.\n2008\tSingeisen, S. (2008, October). Interdisciplinary Studios/Design as Applied Research. Panelist presented at the 2008 ACSA Administrators Conference, Savannah, GA.\n2008\tSingeisen, S. (2008, January). Sustainability Through Community Stewardship. Panelist presented at the Focus The Nation, Savannah, GA.\n2007 \tSingeisen, S. (2007, March). Translations within the Curriculum. Session chair at the 23rd National Conference on the Beginning Design Student, Savannah College of Art and Design, Savannah, GA.\n2005 \tSingeisen, S. (2005, February). Practicing Critical Regionalism. Session chair at the Fourth Savannah Symposium: Architecture and Regionalism, Savannah College of Art and Design, Savannah, GA.\n2000 \tSingeisen, S. (2000, January). Daytona Beach Bandshell. Presentation at the Conservation and Preservation of Coquina - A Symposium on Historic Building Material in the Southeast, State Bureau of Historic Preservation St. Augustine, FL.\n2000 \tSingeisen, S. (2000, January). Tarragona Arch. Presentation at the Conservation and Preservation of Coquina - A Symposium on Historic Building Material in the Southeast, State Bureau of Historic Preservation St. Augustine, FL.\nCONTRACTS, FELLOWSHIPS, GRANTS AND SPONSORED RESEARCH:\n\n2024 \tSingeisen, S., \"The Influence of Lithography Printmaking on Architectural Image Production and Reception,\" Sponsored by NCCU, North Carolina Central University, $8,276.00. (November 15, 2023 - November 15, 2024).\n2024 \tSingeisen, S., \"NCCU-Duke Digital Humanities Course Development Fellowship,\" Sponsored by Mellon Humanities Unbounded initiative at Duke University, Private, $2,000.00. (June 1, 2024 - July 31, 2024).\n2015\tPresidential Fellowship for Faculty Development, ‘Architectural Presentation and the Human Figure’, fully funded research fellowship by the President of the Savannah College of Art and Design, Savannah, GA. Grant: $4000 [awarded], applicant.\n2008\tAssessment Grant for Department of Architecture, ‘Developing A Collective Theory of Architectural Education’, Savannah College of Art and Design, Savannah, GA. Grant: $2500 [awarded], applicant.\n2005\tPresidential Fellowship for Faculty Development, ‘Architecture and Preservation Case Study: Contributing Modernism’, fully funded research fellowship by the President of the Savannah College of Art and Design, Savannah, GA. Grant: $4000 [awarded], applicant.\nEXHIBITS AND PERFORMANCES:\n\n2024 \tSingeisen, S., \"Faculty Exhibition,\" Scott Singeisen, NCCU Department of Art & Design, NCCU Museum of Art, Durham, NC, United States. (February 29, 2024 - March 22, 2024).\n2016\tCurator. Disegno. 2016, Savannah, GA. Exploring the formalization of architectural thinking as both an iterative act of drawing and a mode of critical inquiry.\n2015\tLead faculty member/designer. Dakota Jackson: The Making of Dakota Jackson. SCAD Museum of Art, 2015, Savannah, GA. “The Making of Dakota Jackson,” the first major museum exhibition and retrospective of furniture designer Dakota Jackson.\n2012\tCurator. Democracy of Public Space. DeSotoRow Gallery, 2012, Savannah, GA. Exhibition of student work from the fall of 2012 Urban Studio investigates the democracy of public space, as a projection of needs fifty years in Savannah’s future.\n2011\tCo-curator with Brian Wishne. Take Two. City of Beaufort, The Loft at City Hall, 2011, Beaufort, SC. Three exhibits sponsored by the Beaufort three-century project. An exhibition of graduate architecture student work demonstrating how the valued built forms of Beaufort can be successfully fused with the future requirements for sustainability of energy, water, materials, human ecology, and indigenous vegetation. \n2010\tCurator. Leon & Rob Krier: Exhibition of recent work. Eichberg Hall Gallery, Savannah College of Art and Design, 2010, Savannah, GA.\n2010\tCurator. Beaufort 2011 Expo – Architecture and Neighborhood Designs. City of Beaufort, The Verdier House, 2010, Beaufort, SC. An exhibition of graduate architecture student work. \n2007\tCurator. Operation Home Delivery. Habitat for Humanity, Savannah College of Art and Design, Eichberg Hall, 2007, Savannah, GA.\n2007 \tSingeisen, S. (2007, June). Presentation at the 7th International Symposium on Asia Pacific Architecture: Architecture + Movement, University of Hawaii at Manoa, School of Architecture, Honolulu, HI.\n2003\tSingeisen, S. (2003, March). Exhibition of Architectural Design Guidelines, Boundary District Ordinance Preparation, Deltona, FL at Deltona, FL City Hall.\nRESEARCH ACTIVITY:\n\n2024 \t\"The Influence of Fine Art Printmaking on Architectural Image Production and Reception\" (ongoing). (May 18, 2024 - Present). Fine art printing has left an indelible mark on the trajectory of architectural development. This research delves into the intersection of fine art printmaking and architecture, probing how the artistic rendering of architectural images has shaped public perception of architectural projects. Remarkably, this inquiry remains largely unexplored within the realm of architectural history or art history.\n2024\t“Digital Eagles Nest” (ongoing). (June 1, 2024 – Present). Blending the architectural, cultural, and social histories in a cross-disciplinary digital humanities project capturing the buildings of the NCCU campus, digitizing them, and building a digital campus resource.\nTEACHING EXPERIENCE:\nNorth Carolina Central University\nARTA 2240: Global Chronicle of Architecture, 1 course.\nARTA 2435: Principles of Natural Systems, 1 course.\nARTA 2440: Digital Representation for Architecture, 1 course.\nARTA 2445: Fundamentals of Structures and Materials, 1 course.\nARTV 2730: Portfolio I, 1 course.\nARTF 2310: Design Thinking 2D, 2 courses.\nARTA 3705: Structural Design for Architects Syllabus, 1 course.\nARTF 3980: Independent Study in Art & Design, 1 course.\n\nSavannah College of Art and Design\nFoundations\nDRAW 115: Graphics for the Building Arts\nDSGN 223: Architecture Fundamentals Studio I\nDSGN 224: Architecture Fundamentals Studio II\nDSGN 225: Architecture Fundamentals Studio III\n\nArchitecture (undergraduate)\nARCH 101: Introduction to Architecture\nARCH 301: Architecture Design Studio I: Human-Centered Design\nARCH 302: Architecture Design Studio II: Site and Environmental Context\nARCH 303: Architecture Design Studio III: Structure\nARCH 341: Construction Technology II\nARCH 404: Architecture Design Studio IV: Architecture in the Urban Context\nARCH 405: Architecture Design Studio V: Capstone I\nARCH 406: Architecture Design Studio VI: Capstone II\nARCH 484: Nascent Materials and Construction Technology\nARCH 490: Portfolio Preparation/Presentation\n\nArchitecture (graduate)\nARCH 717: Graduate Architecture Studio I: Urban Design and Development\nARCH 745: Graduate Seminar in Architecture\nARCH 747: Graduate Architecture Studio IV: Focus Studio\nARCH 754: Architecture Seminar\nARCH 770: Graduate Architecture Portfolio\nARCH 779: Graduate Teaching Internship\nARCH 785: Graduate Independent Study\nARCH 798: Graduate Architecture Studio: Thesis I\nARCH 799: Graduate Architecture Studio: Thesis II\n\nPreservation Design\nPRES 410: Studio VII: Design in the Built Environment\nPRES 702: Style and Elegance in the Classical Tradition\n\nInterior Design\nINDS 100: Interior Graphics\n\nUrban Design\nURBA 220: Urban Design Studio I: Region\nURBA 320: Urban Design Studio II: District\nURBA 709: Graduate Urban Design Studio I: Region\nURBA 729: Graduate Urban Design Studio II: District\nURBA 769: Urban Design Research Seminar\nURBA 791: Graduate Urban Design Studio IV: Thesis I\nURBA 792: Graduate Urban Design Studio V: Thesis II\n\nTEACHING INNOVATION AND CURRICULUM DEVELOPMENT\n\nNew Degree Program. B. Arch (First professional degree, Bachelor of Architecture). January 8, 2024 - Present. Throughout the spring semester of 2024, continuing into the summer, and in the final stages of buy-in, Prof. Singeisen developed, wrote, and edited a proposal for the UNC System Board of Governors to establish a professional B.Arch program at NCCU.\nNew Degree Program. Minor in Architecture. September 15, 2023 - April 2, 2024. Worked with the department chairperson to develop, submit, and champion a minor degree in architecture available to students of NCCU.\nCurricular Development. SCAD Faculty Council Focused Writing Support. 2018 - 2019.\nNew Degree Program. Integrated Path to Licensure (IPAL). 2014 - 2017.\nCurricular Development. SCAD Faculty Council Interdisciplinary Collaboration. 2010 - 2016.\nFACULTY DEVELOPMENT ACTIVITIES ATTENDED\n\n2024\tConference Attendance, \"LILLY Conference,\" NCCU Office of Faculty Professional Development, Asheville, NC, United States. (August 5, 2024 - August 7, 2024).\n2024\tWorkshop, \"NEH-Digital Explorations into NCCU's History-Faculty DH 3-day seminar,\" NEH, Durham, NC, United States. (May 13, 2024 - May 15, 2024).\n2024\tTutorial, \"Digital Workflows Training hosted by Prof. Hawkins,\" Department of Art & Design, Durham, NC, United States. (May 3, 2024).\n2024\tWorkshop, \"SoftChalk Overview Training: LMS - Canvas,\" NCCU Office of E-Learning, Durham, NC, United States. (April 17, 2024).\n2024\tWorkshop, \"Copyright and AI,\" Duke University, Durham, NC, United States. (April 16, 2024).\n2024\tTraining, \"People Admin Software Training,\" NCCU ARMO, Durham, NC, United States. (March 28, 2024).\n2024\tTutorial, \"OIRA Open House,\" NCCU OIRA, Durham, NC, United States. (March 26, 2024).\n2024\tTutorial, \"Neural Hallucinations V1.0,\" Design Morphine, Durham, NC, United States. (March 24, 2024).\n2024\tWorkshop, \"AI in Higher Ed: Where We Are and Where We Are Going,\" UNC System Learning and Technology. (March 22, 2024).\n2024\tSeminar, \"Carolina Seminar on Critical Game Studies Session 4,\" University of North Carolina. (March 7, 2024).\n2024\tWorkshop, \"Environment-Reactive Computation with Jacob Lehrer,\" Parametric Architecture Academy. (March 2, 2024 - March 3, 2024).\n2024\tTraining, \"Degree Works Training by ECU,\" NCCU Advising, Durham, NC, United States. (February 26, 2024).\n2024\tWorkshop, \"Understanding Black First-gen Men,\" NASPA. (February 15, 2024).\n2024\tWorkshop, \"Self Regulated Learners Workshop,\" Office of Faculty Professional Development, Durham, NC, United States. (February 8, 2024).\n2024\tWorkshop, \"RUW: The future generation of NET ZERO buildings from Zaha Hadid Architects (w/ Materials course invited) 1/31/24,\" McNeel Europe. (January 31, 2024).\n2024\tWorkshop, \"Junior Faculty Faculty Learning Community,\" College of Art, Social Sciences, and Humanities, Durham, NC, United States. (January 26, 2024).\n2023\tTutorial, \"ADA Accessibility Training,\" NCCU, Durham, NC, United States. (December 1, 2023).\n2023\tWorkshop, \"Measuring Inclusion in the Syllabus: A Tool to Guide Change in Equitable Teaching,\" Teaching & Learning Series: From Culturally Relevant Pedagogy to Praxis. (December 1, 2023).\n2023\tSeminar, \"Carolina Seminar on Critical Game Studies Session 3: Transdisciplinary Theory,\" University of North Carolina. (November 28, 2023).\n2023\tWorkshop, \"Junior Faculty Faculty Learning Community,\" College of Art, Social Sciences, and Humanities, Durham, NC, United States. (November 10, 2023).\n2023\tSymposium, \"UNC - Duke Critical Games Symposium II,\" Computational Media, Arts & Cultures at Duke University, Durham, NC, United States. (November 3, 2023).\n2023\tWorkshop, \"Creating Culturally Responsive Science and STEM Classrooms,\" Teaching & Learning Series: From Culturally Relevant Pedagogy to Praxis. (November 3, 2023).\n2023\tWorkshop, \"Community of Practice Faculty Learning Community,\" College of Art, Social Sciences, and Humanities, Durham, NC, United States. (October 25, 2023).\n2023\tSeminar, \"Carolina Seminar on Critical Game Studies: Critical Design Workshop 1,\" University of North Carolina. (October 24, 2023).\n2023\tWorkshop, \"Junior Faculty Faculty Learning Community,\" College of Art, Social Sciences, and Humanities, Durham, NC, United States. (October 13, 2023).\n2023\tWorkshop, \"Using Historical Personal Narratives as Culturally Relevant Practice to Engage Student Learning,\" Teaching & Learning Series: From Culturally Relevant Pedagogy to Praxis. (October 13, 2023).\n2023\tSeminar, \"Carolina Seminar on Critical Game Studies Session 1: Transdisciplinary Methods,\" University of North Carolina. (September 26, 2023).\n2023\tWorkshop, \"Rhino User Webinar: Harnessing the power of generative design to shape better cities,\" McNeel Associates (Rhino), Durham, NC, United States. (September 6, 2023).\n2023\tWorkshop, \"Rhythmic Continuum V1.0,\" Design Morphine. (January 29, 2023).\n2023\tWorkshop, \"Microbial Drift V1.0,\" Design Morphine. (January 28, 2023).\n2023\tWorkshop, \"Solid Skins V1.0,\" Design Morphine. (January 22, 2023).\n2023\tWorkshop, \"Immersive Patterns V1.0,\" Design Morphine. (January 21, 2023).\n2023\tContinuing Education Program, \"Professional Certificate in Data Science,\" Harvard University. (2018).\n2023\tContinuing Education Program, \"Professional Certificate in Rhino & Grasshopper,\" McNeel & Associates. (2018).\n2023\tContinuing Education Program, \"Certificate in Leadership,\" Dorrier Underwood Mastery Program. (2010).\nUNIVERSITY SERVICE:\n2024 – present\tFaculty Senate, Alternate. Representing the Department of Art & Design. (August 14, 2024 – Present).\n2024 - present\tCommittee Member, AI Working Group. This group serves as a resource for information on AI at the request of the provost. It will take the lead in developing the university’s statement on AI, as well as policies focused on this topic. (January 24, 2024 - Present).\n2024 – present\tProfessional Development Committee Co-Chair, AI Working Group. (April 9, 2024 - Present).\n2024 – present \tChair, Department Student Success Committee. (February 21, 2024 - Present).\n2024 – present \tCommittee Member, Black History Month Activities Committee. (February 21, 2024 - Present).\n2024 – present \tCommittee Member, Department Recruitment Committee. (February 21, 2024 - Present).\n2024 – present \tCommittee Member, Homecoming Activities Committee. (February 21, 2024 - Present).\n2024 – present\tAdvisor, Department Student Art & Design Club.\n2024\tChair, Faculty Search Committee for (EPA03095P) Associate Professor of Architecture Position. (April 15, 2024 - May 17, 2024).\n2024 \tCommittee Member, Faculty Search Committee for (EPA03094P) Associate Professor of Art History Position. (April 1, 2024 - April 30, 2024).\n2021 - 2023\tCurriculum and Assessment Committee, committee chair, Department of Architecture, Savannah College of Art and Design, Savannah, GA.\n2012 - 2023\tAssociation of Collegiate Schools of Architecture, faculty councilor\n2018 - 2019\tSCAD Faculty Council: Focused Writing Support, Council Chair, Savannah College of Art and Design, Savannah, GA.\n2014 - 2017\tIntegrated Path to Licensure Department Committee, Savannah College of Art and Design, Savannah, GA. \n2010 – 2016\tSCAD Faculty Council: Interdisciplinary Collaboration, Savannah College of Art and Design, Savannah, GA.\n2012 - 2013\tAmerican Institute of Architecture Students Faculty Liaison, Savannah College of Art and Design Department of Architecture, Savannah, GA.\n2006 - 2012\tFabrication and Media Lab Faculty Liaison, Savannah College of Art and Design Department of Architecture, Savannah, GA.\n2007-2012\tFaculty Search Committee - Committee Member, Savannah College of Art and Design Department of Architecture, Savannah, GA.\n2007 - 2008\tDean Search Committee - Committee Member, Savannah College of Art and Design School of Building Arts, Savannah, GA.\n2006-2007\tLecture Series Coordinator, Savannah College of Art and Design Department of Architecture, Savannah, GA.\n2006-2007\tFundamental Theory Coordinator, Savannah College of Art and Design Department of Architecture, Savannah, GA.\n2004-2007\tNAAB Accreditation Secretary & Committee Member, Savannah College of Art and Design Department of Architecture, Savannah, GA.\n2004-2007\tAmerican Institute of Architecture Students Faculty Liaison, Savannah College of Art and Design Department of Architecture, Savannah, GA.\nPROFESSIONAL SERVICE:\n2018 - present\tEditorial Review Board Member, FORMA CIVITATIS International Journal of Urban and Territorial Morphological Studies, Lambrechtshagen, Deutschland. (2018 - Present).\n2009 - present\tReviewer/Referee, Routledge Taylor & Francis Group Academic Review Panel, Taylor & Francis Books LTD, Abingdon, Oxon, UK.\n2009 - present\tReviewer/Referee, Fairchild Books Book Proposal Reviewer, Fairchild Books, New York, NY.\n2008 - present\tReviewer/Referee, Wiley Publishing Book Proposal Reviewer, John Wiley & Sons, Inc., Hoboken, NJ.2018 - present\tEditorial Board Member, FORMA CIVITATIS International Journal of Urban and Territorial morphological studies\n2024\tInvited Design Critic, in situ Real Matter, Raleigh, NC. (July 31, 2024).\n2024\tReviewer/Referee, ACSA 113th Annual Meeting Peer Abstract Reviewer, Washington, DC. (June 24, 2024).\n2024\tAttendee, Meeting, North Carolina Pathways Summit, UNC Charlotte, NC. (June 20, 2024 – June 21, 2024).\n2023 - 2024 \tAttendee, Meeting, Columbia GSAPP AFFIRMATIONS, New York, NY. (September 7, 2023 - April 3, 2024).\n2023\tReviewer/Referee, Building Technology Educators Symposium, Savannah, GA. (February 2023).\n2023\tInvited Design Critic, University of North Carolina, School of Architecture, Charlotte, NC. (November 6, 2023).\n2023\tAttendee, Meeting, AIA Wilmington, Wilmington, NC. (September 8, 2023).\n2023\tInvited Design Critic, University of North Carolina, School of Architecture, Charlotte, NC. (January 2023 - May 2023).\n2023\tInvited Design Critic, University of North Carolina, School of Architecture, Charlotte, NC. (April 29, 2023).\n2022\tReviewer/Referee, Beginning Design Student Conference, Savannah, GA. (2022).\n2021\tThesis Research Collaborative Review, Kennesaw State University, Marietta, GA. (2021).\n2020\tThesis Research Collaborative Review, Kennesaw State University, Marietta, GA. (2020).\n2020\tBoard of Directors, Design Communication Association, Atlanta, GA. (2018 - 2020).\n2019\tReviewer/Referee, National Conference on the Beginning Design Student. (2018 - 2019).\n2012 - 2019\tAccreditation Visiting Team Member, National Architectural Accrediting Board (NAAB), Baton Rouge, LA. (2012 - 2019).\n2018\tInvited Competition Juror, Design Communication Association, Ithica, NY. (2018).\n2016 - 2018\tBoard of Advisors, International Centre for Heritage Studies, Kyrenia, Cyprus. (2016 - 2018).\n2014 - 2018\tEditor, FORMA CIVITATIS International Journal of Urban and Territorial Morphological Studies, Lambrechtshagen, Deutschland. (2014 - 2018).\n2017\tInvited Design Critic, Clemson University, Clemson, SC. (2017).\n2017\tInvited Integrated Design Competition, Kennesaw State Uniiversity, Marietta, GA. (2017).\n2016\tInvited Design Critic, Kennesaw State University, Marietta, GA. (2016).\n2016\tTask Force Member, AIA, Washington, DC. (2016).\n2014\tInvited Design Critic, Kennesaw State University, Marietta, GA. (2014).\n2013 - 2014\tCommittee Member, ACSA Mid Atlantic Region, Savannah, GA. (2013 - 2014).\n2012 - 2014\tEditorial Review Board Member, FORMA CIVITATIS International Journal of Urban and Territorial Morphological Studies, Lambrechtshagen, Deutschland. (2012 - 2014).\n2013\tInvited Design Critic, Southern Polytechnic State University, Marietta, GA. (2013).\n2012\tInvited Design Critic, Southern Polytechnic State University, Marietta, GA. (2012).\n2011\tInvited Design Critic, Southern Polytechnic State University, Marietta, GA. (2011).\n2008 - 2010\tCommittee Member, Social Intelligent Design 2010 Conference, London, U.K. (2008 - 2010).\n2007 - 2009\tConference Co-organizer, 2008 ACSA Administrators Conference, Savannah, GA. (September 2007 - April 2009).\n2008 - 2009\tConference Co-organizer, ACSA 2009 Southeast Fall Regional Conference, Savannah, GA. (September 2008 - March 2009).\n2007\tJuror, Savannah River Landing Invited Landscape Architect Competition, Savannah, GA. (2007).\n2006 - 2007\tConference Co-organizer, 23rd National Conference on the Beginning Design Student, Savannah, GA. (September 2006 - March 2007).\n2006\tReviewer/Referee, ACSA Annual Meeting. (2006).\n2002\tInvited Design Critic, Florida Atlantic University, School of Architecture, Fort Lauderdale, FL. (2002).\n2002\tInvited Design Critic, University of Florida, School of Architecture, Gainesville, FL. (2002).\n2002\tJuror, Associated Builders and Contractors Awards, Orlando, FL. (2002).\nPUBLIC SERVICE:\n2024\tVolunteer, North Carolina National Organization of Minority Architects, Durham, NC. (April 27, 2024).\n2024\tVolunteer, Do Greater Charlotte, Charlotte, NC. (March 13, 2024 - April 24, 2024).\n2007 – 2008\tCommittee Member, Affordable Housing Task Force, City of Savannah, Savannah, GA. (2007 - 2008)": null}